#include <reg51.h>

//利用两个定时器控制蜂鸣器发声，定时器0控制频率，定时器1控制同个频率持续的时间，
//间隔300ms依次输出1、10、50、100、200、400、800、1000hz的方波

sbit beep = P1^5;

int count0 = 0;
int count1 = 0;
int flag = 0;

int main()
{
	//开启中断
	EA = 1;  //总中断
	ET0 = 1; //定时/计数器0的中断控制位
	ET1 = 1; //定时/计数器1的中断控制位
	
	//设置定时/计数器0 的模式
	TMOD = 0x01;  //中断的工作方式为方式1
	TR0 = 1;  //启动定时/计数器
	
	//设置定时/计数器1 的模式
	TMOD = 0x10;  //中断的工作方式为方式1
	TR1 = 1;  //启动定时/计数器
	
	//或者把两个定时/计数器的工作模式同时写进寄存器
//	TMOD = 0x11;
//	TCON = 0x50;
	
	//定时/计数器0 控制频率
	TH0 = (65536-50000) / 256;  //定时50ms
	TL0 = (65536-50000) % 256;
	
	
	
	//定时/计数器1 控制持续时间
	//300ms
	TH1 = (65536-30000) / 256;  //定时时间30ms
	TL0 = (65536-30000) % 256;
	
	
	while(1)
	{
		if(count0 % 2 == 0 && flag < 10)
		{
			beep = 1;
		}
		else
		{
			beep = 0;
		}
		
		if(count1 == 80)
		{
			count1 = 0;
		}
	}
	return 0;
}

//定时/计数器0
void timerInterrupt0() interrupt 1
{
	if(count1 > 0 && count1 <= 10)  //1hz
	{
		TH0 = (65536-50000) / 256;  //定时50ms
		TL0 = (65536-50000) % 256;
		flag++;
	}
	else if(count1 > 10 && count1 <= 20) //10hz
	{
		TH0 = (65536-5000) / 256;  //定时50ms
		TL0 = (65536-5000) % 256;
		
	}
	else if(count1 > 20 && count1 <= 30) //50hz
	{
		TH0 = (65536-20000) / 256;  //定时20ms
		TL0 = (65536-20000) % 256;
	}
	else if(count1 > 30 && count1 <= 40) //100hz
	{
		TH0 = (65536-5000) / 256;  //定时5ms
		TL0 = (65536-5000) % 256;
	}
	else if(count1 > 40 && count1 <= 50)  //200hz
	{
		TH0 = (65536-2500) / 256;  //定时2.5ms
		TL0 = (65536-2500) % 256;
	}
	else if(count1 > 50 && count1 <= 60) //400hz
	{
		TH0 = (65536-1250) / 256;  //定时1.25ms
		TL0 = (65536-1250) % 256;
	}
	else if(count1 > 60 && count1 <= 70) //800hz
	{
		TH0 = (65536-625) / 256;  //定时0.625ms
		TL0 = (65536-625) % 256;
	}
	else //1000hz
	{
		TH0 = (65536-500) / 256;  //定时0.5ms
		TL0 = (65536-500) % 256;
	}
	count0++;
	
}

//定时/计数器1
void timerInterrupt1() interrupt 3
{
	TH1 = (65536-30000) / 256;  //定时时间30ms
	TL0 = (65536-30000) % 256;
	count1++;
	if(count1 % 10 == 0)
	{
		count0 = 0;
		flag = 0;
	}
}